{
"status": "ok",
"totalResults": 365,
"articles": [
{
"source": {
"id": null,
"name": "MacRumors"
},
"author": "Joe Rossignol",
"title": "Apple to Upgrade iPhone 17 Displays in These Two Ways",
"description": "All of the iPhone 17 models coming later this year will feature two display upgrades, according to information shared by Digital Chat Station, an account with more than three million followers on Chinese social media platform Weibo.\n\n\n\n\n\nFirst, the account sa…",
"url": "https://www.macrumors.com/2025/07/19/iphone-17-displays-two-upgrades/",
"urlToImage": "https://images.macrumors.com/t/kmk-hyxizdo1yDAAukPuuY9oJfk=/1785x/article-new/2023/11/iphone-16-pro-ghost-hand.jpg",
"publishedAt": "2025-07-19T12:45:00Z",
"content": "All of the iPhone 17 models coming later this year will feature two display upgrades, according to information shared by Digital Chat Station, an account with more than three million followers on Chi… [+1129 chars]"
},
{
"source": {
"id": null,
"name": "MacRumors"
},
"author": "MacRumors Staff",
"title": "Top Stories: iPhone 17 Colors, iOS 26 Public Beta Incoming, and More",
"description": "We're less than two months away from the official unveiling of the iPhone 17 family, and it seems like things are starting to firm up about just which color options we might see across the four models in the lineup.\n\n\n\n\n\nThe iOS 26 public beta is also rapidly…",
"url": "https://www.macrumors.com/2025/07/19/top-stories-iphone-17-colors/",
"urlToImage": "https://images.macrumors.com/t/NaK-lLuECjrNPza2VTSO5mGB_ig=/1600x/article-new/2025/07/top-stories-2025-07-19.jpg",
"publishedAt": "2025-07-19T13:00:00Z",
"content": "We're less than two months away from the official unveiling of the iPhone 17 family, and it seems like things are starting to firm up about just which color options we might see across the four model… [+4368 chars]"
},
{
"source": {
"id": null,
"name": "MacRumors"
},
"author": "Mitchel Broussard",
"title": "OWC Takes $130 Off Popular 14-Port Thunderbolt Dock During Back To School Sale",
"description": "OWC kicked off a new Back To School sale this week, offering big discounts on a variety of USB-C docks, memory cards, external drives and enclosures, and Mac accessories. Some of these deals won't be applied until you add the items to your cart, at which time…",
"url": "https://www.macrumors.com/2025/07/19/owc-back-to-school-sale/",
"urlToImage": "https://images.macrumors.com/t/sAilMXs-uyU-jieYLPttgd-XD6I=/2500x/article-new/2025/05/owc-dock-sale.jpg",
"publishedAt": "2025-07-19T13:33:26Z",
"content": "OWC kicked off a new Back To School sale this week, offering big discounts on a variety of USB-C docks, memory cards, external drives and enclosures, and Mac accessories. Some of these deals won't be… [+1041 chars]"
},
{
"source": {
"id": null,
"name": "Hackaday"
},
"author": "John Elliot V",
"title": "Before Macintosh: The Story of the Apple Lisa",
"description": "Film maker [David Greelish] wrote in to let us know about his recent documentary: Before Macintosh: The Apple Lisa. The documentary covers the life of the Apple Lisa. It starts with the genesis of …",
"url": "https://hackaday.com/2025/07/18/before-macintosh-the-story-of-the-apple-lisa/",
"urlToImage": "https://hackaday.com/wp-content/uploads/2025/07/before-macintosh-banner.png",
"publishedAt": "2025-07-19T02:00:17Z",
"content": "Film maker [David Greelish] wrote in to let us know about his recent documentary: Before Macintosh: The Apple Lisa.\r\nThe documentary covers the life of the Apple Lisa. It starts with the genesis of t… [+1715 chars]"
},
{
"source": {
"id": null,
"name": "Xataka.com"
},
"author": "Alberto García",
"title": "Ofertas de Apple, Xiaomi, eReaders y más. Cinco chollos para aprovechar las campañas de El Corte Inglés",
"description": "El Corte Inglés ha lanzado un buen número de campañas tras el Prime Day de Amazon. Ofertas de Apple, los Xiaomi Days, descuentos en eReaders y en ordenadores... Por este motivo, en este artículo vamos a repasar cinco de las mejores ofertas que vamos a encontr…",
"url": "https://www.xataka.com/seleccion/ofertas-apple-xiaomi-ereaders-cinco-chollos-para-aprovechar-campanas-corte-ingles",
"urlToImage": "https://i.blogs.es/52b1cb/el-corte-ingles/840_560.jpeg",
"publishedAt": "2025-07-19T08:46:33Z",
"content": "El Corte Inglés ha lanzado un buen número de campañas tras el Prime Day de Amazon. Ofertas de Apple, los Xiaomi Days, descuentos en eReaders y en ordenadores... Por este motivo, en este artículo vamo… [+3451 chars]"
},
{
"source": {
"id": null,
"name": "Xataka.com"
},
"author": "Yúbal Fernández",
"title": "Cómo crear música con IA: 14 herramientas gratis imprescindibles",
"description": "Te traemos una recopilación con las mejores 14 herramientas para crear música con inteligencia artificial, de forma que puedas convertir esa idea en sonido. Si quieres hacer una canción con IA o una pieza musical instrumental, estas herramientas te van a perm…",
"url": "https://www.xataka.com/basics/como-crear-musica-ia-14-herramientas-gratis-imprescindibles",
"urlToImage": "https://i.blogs.es/610c33/musica-por-ia/840_560.jpeg",
"publishedAt": "2025-07-19T10:01:34Z",
"content": "Te traemos una recopilación con las mejores 14 herramientas para crear música con inteligencia artificial, de forma que puedas convertir esa idea en sonido. Si quieres hacer una canción con IA o una … [+7719 chars]"
},
{
"source": {
"id": "abc-news",
"name": "ABC News"
},
"author": "Max Zahn",
"title": "What have Trump's tariffs achieved so far? Experts weigh in.",
"description": "The policy remains in flux months after \"Liberation Day.\"",
"url": "https://abcnews.go.com/Business/trumps-tariffs-achieved-experts-weigh/story?id=123859218",
"urlToImage": "https://i.abcnewsfe.com/a/1940e8b4-ad68-4457-87f0-06698d26fbf6/trump-9-ap-er-250715_1752608657520_hpMain_16x9.jpg?w=1600",
"publishedAt": "2025-07-19T10:17:56Z",
"content": "President Donald Trumps tariffs tanked markets and unleashed recession forecasts when the president unveiled sweeping levies little more than 100 days ago. Now, as Trump continues to tout the policy,… [+5358 chars]"
},
{
"source": {
"id": null,
"name": "Gizmodo.com"
},
"author": "Luc Olinga",
"title": "The AI Ghost in the Machine Fired Him. Then It Gave Him a New Life",
"description": "After an algorithm ended his career, Mark Quinn, 45, hired it to start a new one.",
"url": "https://gizmodo.com/the-ai-ghost-in-the-machine-fired-him-then-it-gave-him-a-new-life-2000631675",
"urlToImage": "https://gizmodo.com/app/uploads/2025/07/quinn-1200x675.jpg",
"publishedAt": "2025-07-19T13:20:24Z",
"content": "Mark Quinns story usually begins with an ending: a seasoned tech executive at companies like Apple and Amazon who was, in the ultimate tech irony, laid off because of AI. But the headline misses the … [+6492 chars]"
},
{
"source": {
"id": null,
"name": "Gizmodo.com"
},
"author": "Kyle Barr",
"title": "This Dock Is the Only Way to Play the Switch 2 in AR. It Was a Very Awkward Experience.",
"description": "Local multiplayer has never been weirder than with two friends hooked up to separate pairs of AR glasses.",
"url": "https://gizmodo.com/this-dock-is-the-only-way-to-play-the-switch-2-in-ar-it-was-a-very-awkward-experience-2000631019",
"urlToImage": "https://gizmodo.com/app/uploads/2025/07/Viture-AR-Glasses-Controller-review-1-1200x675.jpg",
"publishedAt": "2025-07-19T13:00:12Z",
"content": "I should be used to sticking odd contraptions on my head during plane flights. Ive planted a Meta Quest 3S and Apple Vision Pro over my eyes as my in-flight entertainment and tried not to get motion … [+7747 chars]"
},
{
"source": {
"id": null,
"name": "BBC News"
},
"author": null,
"title": "Top policeman shakes South Africa with explosive allegations about his boss",
"description": "Mkhwanazi's explosive claims have resulted in a suspension and the launch of two inquiries.",
"url": "https://www.bbc.com/news/articles/c39zygp0d8yo",
"urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/9bdd/live/3da8d500-62db-11f0-b119-c9d62757b6bb.jpg",
"publishedAt": "2025-07-19T00:29:16Z",
"content": "Khanyisile Ngcobo\r\nNhlanhla Mkhwanazi is known for standing up to his political bosses\r\nA highly respected police officer has shaken South Africa's government - and won the admiration of many ordinar… [+6250 chars]"
},
{
"source": {
"id": null,
"name": "Escapecollective.com"
},
"author": "Dave Rome",
"title": "Every part on a bicycle is safety critical",
"description": "An important PSA.",
"url": "https://escapecollective.com/threaded-43-every-part-on-a-bike-is-safety-critical/",
"urlToImage": "https://escapecollective.com/content/images/2025/07/Threaded-43-every-part-is-safety-critical-15.jpg",
"publishedAt": "2025-07-19T07:43:38Z",
"content": "Its common to hear horror stories about component failures that won't just leave you stranded, but can directly lead to injury, or, in rare cases, even worse. \r\nI often hear people warn against messi… [+8306 chars]"
},
{
"source": {
"id": null,
"name": "heise online"
},
"author": "Tomislav Bezmalinović",
"title": "Metas neue VR-Prototypen loten die Grenzen der Technik aus",
"description": "Meta wird im August voraussichtlich drei neue Headset-Prototypen vorstellen, die bei Sichtfeld und Pixeldichte mit dem menschlichen Auge konkurrieren können.",
"url": "https://www.heise.de/news/Metas-neue-VR-Prototypen-loten-die-Grenzen-der-Technik-aus-10493508.html",
"urlToImage": "https://heise.cloudimg.io/bound/1200x1200/q85.png-lossy-85.webp-lossy-85.foil1/_www-heise-de_/imgs/18/4/9/0/0/6/7/4/Meta-Wide-FOV-Headset-Prototypes-Siggraph-2025-157587867bcc401c.jpg",
"publishedAt": "2025-07-19T11:15:00Z",
"content": "Forscher von Meta Reality Labs Research haben im Vorfeld der Computergrafik-Konferenz SIGGRAPH angekündigt, drei neue Headset-Prototypen vorzustellen und erste Details zu den Geräten veröffentlicht.\r… [+3495 chars]"
},
{
"source": {
"id": null,
"name": "9to5Mac"
},
"author": "Bradley C",
"title": "Apple @ Work: Device management migration arrives with iOS 26 and macOS 26",
"description": "Apple @ Work is exclusively brought to you by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that integrates in a single professional-grade platform all the solutions necessary to seamlessly and automatically deploy, manage, and protect …",
"url": "https://9to5mac.com/2025/07/19/how-device-management-system-migration-works-with-ios-26-and-macos-26/",
"urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/06/wwdc-2025-14.29.42.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
"publishedAt": "2025-07-19T13:00:00Z",
"content": "Apple @ Work is exclusively brought to you by Mosyle, the only Apple Unified Platform. Mosyle is the only solution that integrates in a single professional-grade platform all the solutions necessary … [+5848 chars]"
},
{
"source": {
"id": null,
"name": "9to5Mac"
},
"author": "Michael Burkhardt",
"title": "MacBook Air vs MacBook Pro: Which model makes the most sense to buy in 2025?",
"description": "MacBooks are great computers, but there’s a number of different varieties to think about. Between last gen hardware and all of the current models available now, it can feel like there’s a lot of options. Today, we’ll be breaking down which is right for you, d…",
"url": "https://9to5mac.com/2025/07/18/apple-macbook-comparison-pro-vs-air-m4/",
"urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/10/M4-MacBook-Pro-doesnt-tempt-me-because-Apple-Silicon-Macs-are-almost-too-good.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
"publishedAt": "2025-07-19T03:12:55Z",
"content": "MacBooks are great computers, but there’s a number of different varieties to think about. Between last gen hardware and all of the current models available now, it can feel like there’s a lot of opti… [+4873 chars]"
},
{
"source": {
"id": null,
"name": "9to5Mac"
},
"author": "Michael Burkhardt",
"title": "ASUS ProArt 6K Display for Mac users will be available in August, at a compelling price",
"description": "After initially being announced at Computex 2024 last summer, then again showcased at CES 2025 earlier this year – ASUS has finally given us a release timeline, pricing, and feature information for its new 6K 32-inch ProArt display. It’ll be available in late…",
"url": "https://9to5mac.com/2025/07/19/asus-proart-6k-for-mac-users-availability-august/",
"urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/07/Asus-ProArt-6K.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
"publishedAt": "2025-07-19T13:47:42Z",
"content": "After initially being announced at Computex 2024 last summer, then again showcased at CES 2025 earlier this year – ASUS has finally given us a release timeline, pricing, and feature information for i… [+1487 chars]"
},
{
"source": {
"id": null,
"name": "Yanko Design"
},
"author": "Aki Ukita",
"title": "10 Best Summer Travel Gadgets and Accessories for 2025: Design-Forward Picks for Every Trip",
"description": "10 Best Summer Travel Gadgets and Accessories for 2025: Design-Forward Picks for Every TripPacking for a trip always stirs up that familiar blend of excitement and careful planning. You find yourself wondering which little details will keep you...",
"url": "https://www.yankodesign.com/2025/07/18/10-best-summer-travel-gadgets-and-accessories-for-2025-design-forward-picks-for-every-trip/",
"urlToImage": "https://www.yankodesign.com/images/design_news/2025/07/10-best-summer-travel-gadgets-and-accessories-for-2025-design-forward-picks-for-every-trip/Travel-gadgets-and-accessories.jpg",
"publishedAt": "2025-07-19T01:45:34Z",
"content": "Packing for a trip always stirs up that familiar blend of excitement and careful planning. You find yourself wondering which little details will keep you comfortable, organized, and inspired along th… [+12951 chars]"
},
{
"source": {
"id": null,
"name": "Journal du geek"
},
"author": "Thomas Estimbre",
"title": "Keynote iPhone 17 : Apple garde le secret, mais une date se dessine déjà avec une quasi-certitude",
"description": "Nul besoin d'attendre l'invitation officielle d'Apple. Une mécanique implacable, réglée au jour près, a presque fixé la date de présentation de l'iPhone 17.",
"url": "https://www.journaldugeek.com/2025/07/19/keynote-iphone-17-apple-garde-le-secret-mais-une-date-se-dessine-deja-avec-une-quasi-certitude/",
"urlToImage": "https://www.journaldugeek.com/app/uploads/2025/07/apple-iphone-1600x900.jpg",
"publishedAt": "2025-07-19T06:32:09Z",
"content": "Oubliez-les iPhone 16, lheure est presque aux iPhone 17. Face aux nouveaux smartphones pliants de Samsung et aux prochains Pixel de Google, Apple se prépare pour son rendez-vous incontournable de sep… [+2808 chars]"
},
{
"source": {
"id": null,
"name": "Journal du geek"
},
"author": "Julie Hay",
"title": "5 séries à ne pas manquer cet été sur Netflix, Prime Video et Disney+",
"description": "Sortez vos agendas, l'été sera chaud sur vos plateformes de streaming préférées. Voici les séries à ne pas manquer en juillet et en août.",
"url": "https://www.journaldugeek.com/2025/07/19/5-series-a-ne-pas-manquer-cet-ete-sur-netflix-prime-video-et-disney/",
"urlToImage": "https://www.journaldugeek.com/app/uploads/2025/07/series-ete-2025-1600x900.jpg",
"publishedAt": "2025-07-19T11:04:46Z",
"content": "Cet été, les plateformes de streaming par abonnement ne prennent pas de repos. Alors que leurs utilisateurs seront par monts et par vaux, profitant du soleil et de vacances bien méritées, les géants … [+4577 chars]"
},
{
"source": {
"id": null,
"name": "Applesfera.com"
},
"author": "Guille Lomener",
"title": "Apple envió un correo electrónico a las siete de la mañana preguntando sobre el teletrabajo. El personal se lo tomó regular",
"description": "Tim Cook tiene fama de madrugar. Tanto, que para él las siete de la mañana ya es casi mediodía. Pero cuando en abril de 2023 los empleados de Apple se despertaron con una encuesta obligatoria sobre teletrabajo en sus bandejas de entrada a esa hora, probableme…",
"url": "https://www.applesfera.com/curiosidades/apple-envio-correo-electronico-a-siete-manana-preguntando-teletrabajo-personal-se-tomo-regular",
"urlToImage": "https://i.blogs.es/b662e2/mail-mac/840_560.jpeg",
"publishedAt": "2025-07-19T08:01:34Z",
"content": "Tim Cook tiene fama de madrugar. Tanto, que para él las siete de la mañana ya es casi mediodía. Pero cuando en abril de 2023 los empleados de Apple se despertaron con una encuesta obligatoria sobre t… [+5944 chars]"
},
{
"source": {
"id": null,
"name": "Applesfera.com"
},
"author": "Guille Lomener",
"title": "El mejor homenaje al iPod no es un nuevo reproductor de música. Es esta cartera hecha con piezas originales",
"description": "El 23 de octubre de 2001, Steve Jobs subió al escenario con un dispositivo que cabía en el bolsillo y prometía \"1.000 canciones en tu bolsillo\". Veinticuatro años después, el iPod ya es cosa del pasado, y ni siquiera se vende en la web de Apple. Pero su legad…",
"url": "https://www.applesfera.com/ipod/mejor-homenaje-al-ipod-no-nuevo-reproductor-musica-esta-cartera-hecha-piezas-originales",
"urlToImage": "https://i.blogs.es/eb7f19/cartera-en-ipod/840_560.jpeg",
"publishedAt": "2025-07-19T11:01:34Z",
"content": "El 23 de octubre de 2001, Steve Jobs subió al escenario con un dispositivo que cabía en el bolsillo y prometía \"1.000 canciones en tu bolsillo\". Veinticuatro años después, el iPod ya es cosa del pasa… [+2421 chars]"
},
{
"source": {
"id": null,
"name": "Xataka Android"
},
"author": "Eva R. de Luis",
"title": "Ya no uso Google Maps a secas: Gemini se ha convertido en mi copiloto para elegir la ruta ideal cuando viajo",
"description": "Google está añadiendo Gemini a todos sus productos y Google Maps no es una excepción. Así, puede ayudarnos para tener más información de locales y puntos de interés. Ya he comentado alguna vez que al volante prefiero Waze a Google Maps, pero pese a que ambas …",
"url": "https://www.xatakandroid.com/aplicaciones-android/no-uso-google-maps-a-secas-gemini-se-ha-convertido-mi-copiloto-para-elegir-ruta-ideal-cuando-viajo",
"urlToImage": "https://i.blogs.es/ed2455/google/840_560.jpeg",
"publishedAt": "2025-07-19T08:01:34Z",
"content": "Google está añadiendo Gemini a todos sus productos y Google Maps no es una excepción. Así, puede ayudarnos para tener más información de locales y puntos de interés. Ya he comentado alguna vez que al… [+1922 chars]"
},
{
"source": {
"id": null,
"name": "Android Authority"
},
"author": "Robert Triggs",
"title": "Why I pick flexible charging over raw speed every single time",
"description": "Fast charging isn’t everything. Here’s why broad plug support, battery health, and charging choice matter more for your next phone.",
"url": "https://www.androidauthority.com/flexible-fast-charging-oneplus-13-3577609/",
"urlToImage": "https://www.androidauthority.com/wp-content/uploads/2025/04/oneplus-slim-magnetic-power-bank-oneplus-13-scaled.jpg",
"publishedAt": "2025-07-19T12:00:13Z",
"content": "Regular Android Authority readers will know Im a stickler for brilliant battery life backed up by proper fast charging. And by that, I dont necessarily mean the faster the better, a battery needs to … [+7310 chars]"
},
{
"source": {
"id": null,
"name": "Muyinteresante.com"
},
"author": "mgcirac",
"title": "Fabricado en Vigo y vendido en más de 50 países: así es el SUV con etiqueta ECO, asistentes de nivel 2 y tres motorizaciones que enamora por dentro y por fuera",
"description": "Estilo, tecnología y cero emisiones: el Peugeot e‑2008 Style te lo pone fácil para conducir con conciencia sin renunciar al diseño. El SUV eléctrico que demuestra que lo sostenible también puede ser seductor.",
"url": "https://www.muyinteresante.com/actualidad/peugeot-2008-un-suv-atractivo-y-versatil.html",
"urlToImage": "https://www.muyinteresante.com/wp-content/uploads/sites/5/2025/07/Untitled-design120-og.jpg",
"publishedAt": "2025-07-19T07:36:00Z",
"content": "El Peugeot 2008 se consolida como uno de los SUV más atractivos y versátiles del segmento B‑SUV, ahora con la llegada de la nueva Serie Style que refuerza su perfil emocional y accesible. Esta edició… [+5488 chars]"
},
{
"source": {
"id": null,
"name": "Appinn.com"
},
"author": "青小蛙",
"title": "手机系统不一样，如何远程帮父母的小米手机解决问题？",
"description": "前几天，有同学问：父母用小米手机，自己用 iPhone 和 vivo，远程协助由什么推荐方案吗？青小蛙也想知道有没有解决方案，毕竟现在差不多远程控制 = 诈骗，就...很难。于是把问题抛到了微博上，看看大家都有什么好方法",
"url": "https://www.appinn.com/remote-xiaomi-help/",
"urlToImage": "https://www.appinn.com/wp-content/uploads/2025/07/Copy-of-appinn-homework-2025-07-19T200222.278.jpg",
"publishedAt": "2025-07-19T12:16:08Z",
"content": "iPhone vivo\r\n= …\r\n@hsh223 \r\nAPP\r\n…\r\npass\r\n…23\r\napple \r\nFaceTime \r\n…\r\nhttps://www.appinn.com/remote-xiaomi-help/"
},
{
"source": {
"id": null,
"name": "Les Numériques"
},
"author": "Alexandre Scotti",
"title": "Actualité : iPhone 17 Pro vs 17 Pro Max : 3 différences clés entre les futurs modèles premium d’Apple",
"description": "Des différences de taille seraient de la partie entre les iPhone 17 Pro et 17 Pro Max — du design à l’autonomie, en passant par les écrans.",
"url": "https://www.lesnumeriques.com/telephone-portable/iphone-17-pro-vs-17-pro-max-3-differences-cles-entre-les-futurs-modeles-premium-d-apple-n239976.html",
"urlToImage": "https://cdn.lesnumeriques.com/optim/news/23/239976/e42c0790-iphone-17-pro-vs-17-pro-max-3-differences-cles-entre-les-futurs-modeles-premium-d-apple__1200_678__0-91-1989-1135.jpg",
"publishedAt": "2025-07-19T09:17:00Z",
"content": "Là où les iPhone 17 et 17 Air auront une fiche technique bien différente des autres modèles, les Pro et Pro Max se ressembleront beaucoup. Mais quelques différences notables subsisteraient entre ces … [+3737 chars]"
},
{
"source": {
"id": null,
"name": "Les Numériques"
},
"author": "Laure Renouard",
"title": "Actualité : iPhone : cette information cachée que révèle la nouvelle étiquette énergie des smartphones",
"description": "Les smartphones et les tablettes doivent, depuis le 20 juin 2025, être accompagnés d'une Étiquette énergie fournissant à ceux qui plongent dans ses détails quelques informations intéressantes. Et notamment pour le cas des iPhone, dont la capacité des batterie…",
"url": "https://www.lesnumeriques.com/telephone-portable/iphone-cette-information-cachee-que-revele-la-nouvelle-etiquette-energie-des-smartphones-n239912.html",
"urlToImage": "https://cdn.lesnumeriques.com/optim/news/23/239912/13085b1a-etiquette-energie__1200_678__0-188-3000-1763.jpg",
"publishedAt": "2025-07-19T07:31:00Z",
"content": "Apple est connu pour sa discrétion concernant certains éléments techniques relatifs à ses appareils. Le plus symptomatique concerne la batterie de ses smartphones : la Pomme ne mentionne jamais, ô gr… [+2937 chars]"
},
{
"source": {
"id": null,
"name": "Xatakamovil.com"
},
"author": "Eva R. de Luis",
"title": "El creador de Wordle se forró con su app y no fue el único: alguien hizo antes otro Wordle al que también le cambió la vida",
"description": "Corría el año 2022 cuando un juego de lo más simplón (dicho con todo el respeto) se volvía viral: Wordle. Bajo la mundana sencillez de adivinar todos los días una palabra diferente de cinco letras en seis intentos se escondía la auténtica esencia que nos enam…",
"url": "https://www.xatakamovil.com/aplicaciones/creador-wordle-se-forro-su-app-no-fue-unico-alguien-hizo-antes-otro-wordle-al-que-tambien-le-cambio-vida",
"urlToImage": "https://i.blogs.es/391724/wordle/840_560.jpeg",
"publishedAt": "2025-07-19T10:01:34Z",
"content": "Corría el año 2022 cuando un juego de lo más simplón (dicho con todo el respeto) se volvía viral: Wordle. Bajo la mundana sencillez de adivinar todos los días una palabra diferente de cinco letras en… [+2875 chars]"
},
{
"source": {
"id": null,
"name": "Caschys Blog"
},
"author": "André Westphal",
"title": "Lexar NM990: SSD mit PCIe 5.0 und Lesegeschwindigkeit von bis zu 14.000 MB/s",
"description": "Lexar bringt mit der NM990 eine neue SSD mit der Schnittstelle PCI-Express 5.0 (PCIe) auf den Markt. Dank des Standards erreicht sie eine Lesegeschwindigkeit von bis zu 14.000 MB/s. Das kompakte Laufwerk nutzt das Format M.2 2280. Zielgruppe sind laut...Zum B…",
"url": "https://stadt-bremerhaven.de/lexar-nm990-ssd-mit-pcie-5-0-und-lesegeschwindigkeit-von-bis-zu-14-000-mb-s/",
"urlToImage": "https://stadt-bremerhaven.de/wp-content/uploads/2025/07/lexar-nm990.jpg",
"publishedAt": "2025-07-19T13:30:20Z",
"content": "Lexar bringt mit der NM990 eine neue SSD mit der Schnittstelle PCI-Express 5.0 (PCIe) auf den Markt. Dank des Standards erreicht sie eine Lesegeschwindigkeit von bis zu 14.000 MB/s. Das kompakte Lauf… [+2129 chars]"
},
{
"source": {
"id": null,
"name": "Caschys Blog"
},
"author": "André Westphal",
"title": "Smartphones: Weltweiter Markt wächst im 2. Quartal 2025 nur bescheiden",
"description": "Der internationale Markt für Smartphones ist im 2. Quartal 2025 um gerade einmal 1 % gewachsen. Immerhin hat es aber kein Minus gegeben, womit angesichts der aktuellen Weltlage auch einige Marktforscher gerechnet hatten. Dabei versuchen viele Hersteller gerin…",
"url": "https://stadt-bremerhaven.de/smartphones-weltweiter-markt-waechst-im-2-quartal-2025-nur-bescheiden/",
"urlToImage": "https://stadt-bremerhaven.de/wp-content/uploads/2025/02/xiaomi-15-ultra-1.jpg",
"publishedAt": "2025-07-19T12:00:59Z",
"content": "Der internationale Markt für Smartphones ist im 2. Quartal 2025 um gerade einmal 1 % gewachsen. Immerhin hat es aber kein Minus gegeben, womit angesichts der aktuellen Weltlage auch einige Marktforsc… [+2370 chars]"
},
{
"source": {
"id": null,
"name": "IndieWire"
},
"author": "Jim Hemphill",
"title": "‘I Know What You Did Last Summer’ Director on the Shocking Twist Ending — and a Few Other Surprises",
"description": "Spoilers: Jennifer Kaytin Robinson walks IndieWire through what led up to her movie's killer twists, including that delightful post-credits scene.",
"url": "https://www.indiewire.com/features/interviews/i-know-what-you-did-last-summer-2025-ending-explained-1235138744/",
"urlToImage": "https://www.indiewire.com/wp-content/uploads/2025/07/MCDIIKN_CO002.jpg?w=650",
"publishedAt": "2025-07-19T13:00:00Z",
"content": "[Editor’s note: The following interview contains major spoilers for “I Know What You Did Last Summer.”]\r\nOne of the great delights of the new “I Know What You Did Last Summer” for fans of the origina… [+4268 chars]"
},
{
"source": {
"id": null,
"name": "Creative Bloq"
},
"author": "Daniel John",
"title": "Polaroid just dropped the most iconic anti-AI ad of the year",
"description": "Nostalgia and a timely message combine in a potent new campaign.",
"url": "https://www.creativebloq.com/design/branding/polaroid-just-dropped-the-most-iconic-anti-ai-ad-of-the-year",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/JGCdiFKhME5x2aERiXjcAX.jpg",
"publishedAt": "2025-07-19T06:00:00Z",
"content": "How much of your camera roll do you really remember? That's the question asked by one of the posters in Polaroid's latest campaign, which takes aim at digital over-saturation and AI. Designed to prom… [+2099 chars]"
},
{
"source": {
"id": null,
"name": "Nextpit.de"
},
"author": "Artem Sandler",
"title": "Preise für mehrere Apps gestrichen – Ist auch eine App für Euch dabei?",
"description": "Üblicherweise kosten die folgenden acht Apps Geld, doch aktuell sind sie im Rahmen eines Angebots kurzfristig zum Nulltarif erhältlich.",
"url": "https://www.nextpit.de/news/preise-fuer-mehrere-apps-gestrichen-ist-auch-eine-app-fuer-euch-dabei",
"urlToImage": "https://fs.npstatic.com/userfiles/7762777/image/Sonstiges/smartphone-geld-euro-w1400h788.jpg",
"publishedAt": "2025-07-19T08:00:00Z",
"content": "In den beiden App-Stores von Google und Apple, dem Play Store und dem App Store, findet sich eine schier endlose Anzahl an Anwendungen. Einige dieser Apps sind kostenlos, andere wiederum kostenpflich… [+4489 chars]"
},
{
"source": {
"id": null,
"name": "Tomshw.it"
},
"author": "Andrea Maiellano",
"title": "I prossimi visori di META rivoluzioneranno la realtà virtuale",
"description": "Nel laboratorio di Reality Labs, la divisione di realtà virtuale di Meta, stanno prendendo forma dei prototipi che potrebbero rivoluzionare completamente l'esperienza VR come la conosciamo oggi. Si tr...",
"url": "https://www.tomshw.it/smartphone/visori-vr-meta-fov-maggiore-in-dimensioni-mini-2025-07-19",
"urlToImage": "https://www.tomshw.it/storage/media/2025/07/63965/imageBLumyD.jpg",
"publishedAt": "2025-07-19T08:11:38Z",
"content": "Nel laboratorio di Reality Labs, la divisione di realtà virtuale di Meta, stanno prendendo forma dei prototipi che potrebbero rivoluzionare completamente l'esperienza VR come la conosciamo oggi. Si t… [+3815 chars]"
},
{
"source": {
"id": null,
"name": "Googlewatchblog.de"
},
"author": "Jens",
"title": "Android & ChromeOS: Google fusioniert die wichtigen Betriebssysteme – das ist der richtige Weg (Meinung)",
"description": "In dieser Woche ist offiziell verkündet worden, was wir schon seit langer Zeit spekulieren: Google wird die beiden Betriebssysteme Android und ChromeOS fusionieren, sodass diese in Zukunft als gemeinsame Plattform auftreten. Das Einschlagen dieses Weges hat l…",
"url": "https://www.googlewatchblog.de/2025/07/android-chromeos-google-fusioniert-die-wichtigen-betriebssysteme-das-ist-der-richtige-weg-meinung/",
"urlToImage": "https://www.googlewatchblog.de/wp-content/uploads/android-chrome-os-1.jpg",
"publishedAt": "2025-07-19T06:30:52Z",
"content": "In dieser Woche ist offiziell verkündet worden, was wir schon seit langer Zeit spekulieren: Google wird die beiden Betriebssysteme Android und ChromeOS fusionieren, sodass diese in Zukunft als gemein… [+4632 chars]"
},
{
"source": {
"id": null,
"name": "Googlewatchblog.de"
},
"author": "Jens",
"title": "Pixel 10: Das sind die neuen Google-Smartphones – alle Infos (Specs, Infos, Verkaufspreise, Fotos & mehr)",
"description": "In etwas mehr als vier Wochen wird Google die neuen Pixel 10-Smartphones vorstellen und noch im selben Monat in den Verkauf bringen. Dank zahlreicher Leaks in den letzten Wochen könnten viele Nutzer bereits eine Kaufentscheidung getroffen haben oder diese zei…",
"url": "https://www.googlewatchblog.de/2025/07/pixel-10-das-sind-die-neuen-google-smartphones-alle-infos-specs-infos-verkaufspreise-fotos-mehr/",
"urlToImage": "https://www.googlewatchblog.de/wp-content/uploads/pixel-10-pro-xl-2.jpg",
"publishedAt": "2025-07-19T08:45:51Z",
"content": "In etwas mehr als vier Wochen wird Google die neuen Pixel 10-Smartphones vorstellen und noch im selben Monat in den Verkauf bringen. Dank zahlreicher Leaks in den letzten Wochen könnten viele Nutzer … [+10969 chars]"
},
{
"source": {
"id": null,
"name": "Tomshw.it"
},
"author": "Andrea Maiellano",
"title": "iPhone 17 Air: le ultime indiscrezioni sollevano altri dubbi",
"description": "Il mondo della tecnologia mobile si prepara a un compromesso che potrebbe dividere gli utenti: Apple sta sviluppando un iPhone che privilegerà l'estetica rispetto all'autonomia. Secondo le ultime indi...",
"url": "https://www.tomshw.it/smartphone/iphone-17-air-le-ultime-indiscrezioni-deludono-2025-07-19",
"urlToImage": "https://www.tomshw.it/storage/media/2025/03/51616/iPhone-17-Air.jpg",
"publishedAt": "2025-07-19T00:25:24Z",
"content": "Il mondo della tecnologia mobile si prepara a un compromesso che potrebbe dividere gli utenti: Apple sta sviluppando un iPhone che privilegerà l'estetica rispetto all'autonomia. Secondo le ultime ind… [+3989 chars]"
},
{
"source": {
"id": null,
"name": "Techbang.com"
},
"author": "janus",
"title": "27 年前的 Power Mac G3 ROM 中有彩蛋！工程師挖出隱藏開發團隊合照",
"description": "Power Mac G3的ROM中藏有「secret ROM image」彩蛋！輸入「secret ROM image」格式化磁碟，即可見開發團隊合照，重溫蘋果歷史。Linux 核心貢獻者暨工程師 Doug Brown 近日發現了一顆藏在 Apple Power Mac G3 電腦 ROM 裡、可能從來沒有人注意到的復活節彩蛋。這台電腦是在 1997 到 1999 年間推出的經典機種，距今已有 27 年歷史。\n完整發現過程記錄在他的部落格文章中：  Finding a 27-year-old easter e…",
"url": "https://www.techbang.com/posts/123972-power-mac-g3-rom-easter-egg-hidden-photo",
"urlToImage": "https://cdn1.techbang.com/system/excerpt_images/123972/original/38cebf3c555b7e84371a5aa972cbabea.jpg?1750928807",
"publishedAt": "2025-07-19T08:30:00Z",
"content": "Linux Doug Brown Apple Power Mac G3 ROM 1997 1999 27 \r\nFinding a 27-year-old easter egg in the Power Mac G3 ROM\r\nBrown ex Fiend Power Mac G3 ROM ROM Power Mac G3 \r\n 2014 \r\nBrown ROM Pascal secret ROM… [+217 chars]"
},
{
"source": {
"id": null,
"name": "Le HuffPost"
},
"author": "Sarafina Spautz",
"title": "Perdre votre valise vous angoisse ? Ce petit gadget est fait pour vous",
"description": "Ne pas retrouver ses bagages sur le tapis roulant en arrivant à destination est l’angoisse de tout voyageur.",
"url": "https://www.huffingtonpost.fr/tech-futurs/video/perdre-votre-valise-vous-angoisse-ce-petit-gadget-est-fait-pour-vous_252694.html",
"urlToImage": "https://focus.huffingtonpost.fr/2025/07/18/0/0/1920/1080/1820/1023/75/0/3804340_upload-1-01lo7plevx1j-vignette-video-tracker.jpg",
"publishedAt": "2025-07-19T06:00:09Z",
"content": "La lecture de ce contenu est susceptible dentraîner un dépôt de cookies de la part de lopérateur tiers qui lhéberge. Compte-tenu des choix que vous avez exprimés en matière de dépôt de cookies, nous … [+2247 chars]"
},
{
"source": {
"id": null,
"name": "Gizmodo.com"
},
"author": "Lucas Handley",
"title": "¿La impuntualidad revela poco interés y egocentrismo en las personas? Un análisis profundo que lo revela",
"description": "Llegar tarde constantemente no es solo una costumbre: puede reflejar aspectos emocionales, sociales y cognitivos. Psicología e inteligencia artificial aportan nuevas perspectivas.",
"url": "https://es.gizmodo.com/la-impuntualidad-revela-poco-interes-y-egocentrismo-en-las-personas-un-analisis-profundo-que-lo-revela-2000180511",
"urlToImage": "https://es.gizmodo.com/app/uploads/2025/07/Diseno-sin-titulo-24-16-1200x675.jpg",
"publishedAt": "2025-07-19T12:48:26Z",
"content": "La impuntualidad es uno de los hábitos más frecuentes y socialmente aceptados en algunos contextos, pero detrás de ella pueden ocultarse causas mucho más profundas que la mera desorganización. Desde … [+4329 chars]"
},
{
"source": {
"id": "ign",
"name": "IGN"
},
"author": "Matt Purslow",
"title": "Donkey Kong Bananza Ending Explained - How Does it Connect to Mario Odyssey?",
"description": "Is Donkey Kong Bananza connected to Super Mario Odyssey? Learn how three generations of Kong could be the key to Nintendo canon in our ending explained.",
"url": "https://www.ign.com/articles/donkey-kong-bananza-ending-explained-how-does-it-connect-to-mario-odyssey",
"urlToImage": "https://assets-prd.ignimgs.com/2025/07/18/dk-ending-blog-1752853818189.jpg?width=1280&format=jpg&auto=webp&quality=80",
"publishedAt": "2025-07-19T13:00:00Z",
"content": "Warning: this article contains spoilers for Donkey Kong Bananza. \r\nDonkey Kong Bananza is now out in the wild, and one of the biggest burning questions ahead of launch centered on DKs new best friend… [+8310 chars]"
},
{
"source": {
"id": "techradar",
"name": "TechRadar"
},
"author": "Grace Dean",
"title": "The Studio season 2: everything we know so far about the popular Apple TV+ show's return",
"description": "The Studio season 2 was officially renewed in May – here's everything we know so far about the hit comedy's return to Apple TV+.",
"url": "https://www.techradar.com/streaming/apple-tv-plus/the-studio-season-2",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/7dXqG49WUsCM86Ce3fyVzC.jpg",
"publishedAt": "2025-07-19T08:00:00Z",
"content": "The Studio season 2: key information\r\n- Officially renewed in May- Filming reportedly due to begin in December- No official trailer just yet- Main cast all set to return- Plot details kept firmly und… [+6156 chars]"
},
{
"source": {
"id": "techradar",
"name": "TechRadar"
},
"author": "David Nield",
"title": "The latest iPhone 17 Air battery leak is a worrying one – but iOS 26 could help",
"description": "There's more evidence that the new iPhone model could come with a relatively small battery.",
"url": "https://www.techradar.com/phones/iphone/the-latest-iphone-17-air-battery-leak-is-a-worrying-one-but-ios-26-could-help",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/C9KjsN6rQCeaoGsKhDrWRK.jpg",
"publishedAt": "2025-07-19T11:30:00Z",
"content": "<ul><li>The iPhone 17 Air battery could be under 3,000 mAh</li><li>This fits in with previous leaks about the handset</li><li>iOS 26 could extend battery life to last an entire day</li></ul>\r\nWhen Ap… [+2345 chars]"
},
{
"source": {
"id": "techradar",
"name": "TechRadar"
},
"author": "zac.kelly@futurenet.com (Zachariah Kelly) , Zachariah Kelly",
"title": "The Nothing Phone 3 might be the most distinctive smartphone of 2025 – but is it enough to lure in Apple and Samsung fans?",
"description": "The Phone 3 is Nothing’s first attempt at a proper premium handset, and in a hardware month supposed to be Samsung’s, this handset has stolen all my attention.",
"url": "https://www.techradar.com/phones/nothing-phones/the-nothing-phone-3-might-be-the-most-distinctive-smartphone-of-2025-but-is-it-enough-to-lure-in-apple-and-samsung-fans",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/reQSBTQ4YXHWsMzJSSPRZV.png",
"publishedAt": "2025-07-19T10:00:00Z",
"content": "If there’s one thing about Nothing’s entire philosophy as a company that rings completely true, it’s that modern tech looks boring. With focus applied to manufacturing efficiency and broad appeal, th… [+9467 chars]"
},
{
"source": {
"id": "techradar",
"name": "TechRadar"
},
"author": "tom.power@futurenet.com (Tom Power) , Tom Power",
"title": "'The Fantastic Four: First Steps' cast and character guide: Pedro Pascal, Vanessa Kirby, and who else you'll see in the Marvel movie",
"description": "Here are all of the stars you'll see in The Fantastic Four: First Steps, aka the first Marvel Phase 6 movie.",
"url": "https://www.techradar.com/streaming/entertainment/the-fantastic-four-first-steps-cast-and-character-guide-pedro-pascal-vanessa-kirby-and-who-else-youll-see-in-the-marvel-movie",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/atg9qoBhxiHsptmbZaVLMe.jpg",
"publishedAt": "2025-07-19T13:00:00Z",
"content": "It's almost time for the final Marvel movie of 2025. The Fantastic Four: First Steps launches worldwide in late July, and before it arrives, you might be wondering who's in the upcoming superhero fil… [+12576 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "David Phelan, Senior Contributor, \n David Phelan, Senior Contributor\n https://www.forbes.com/sites/appleunboxed/",
"title": "Apple iPhone 17 Air Battery: Latest Leak Has Unwelcome News",
"description": "When the super-slim iPhone nicknamed the iPhone 17 Air glides into view this fall, its thin profile has implications for battery life. Happily, there's good news, too.",
"url": "https://www.forbes.com/sites/davidphelan/2025/07/19/apple-iphone-17-air-battery-unwelcome-news-revealed-in-latest-leak/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/687b65222ccb73d5d84a74fa/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2025-07-19T09:30:30Z",
"content": "Apple is thought to be releasing four iPhones this September (read here for the exact release date). Alongside the iPhone 17, iPhone 17 Pro and iPhone 17 Pro Max will be a super-thin model, presumed … [+1959 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "David Phelan, Senior Contributor, \n David Phelan, Senior Contributor\n https://www.forbes.com/sites/appleunboxed/",
"title": "Apple iPhone 17 And iPhone 17 Pro Design Changes Revealed In Wide-Ranging Leak",
"description": "Want to know what this year’s iPhones will look like? A new leak, corroborated by several sources, claims to know more about the design than ever, down to the colors.",
"url": "https://www.forbes.com/sites/davidphelan/2025/07/19/apple-iphone-17-pro-definitive-new-leak-confirms-key-design-changes/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/66f5a2f380ad925683dd0582/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2025-07-19T09:45:16Z",
"content": "Updated July 19 with more color details for more upcoming iPhones.\r\nWith less than two months until the release of the next iPhones (read full details of the exact date expected here), theres a lot t… [+3325 chars]"
},
{
"source": {
"id": null,
"name": "Forbes"
},
"author": "Tim Lammers, Contributor, \n Tim Lammers, Contributor\n https://www.forbes.com/sites/timlammers/",
"title": "‘Superman’ Eyes $55 Million Take In Second Weekend At Box Office",
"description": "James Gunn’s \"Superman\" is looking at about a 56% drop in business from its opening weekend at the domestic box office in its second Friday to Sunday frame.",
"url": "https://www.forbes.com/sites/timlammers/2025/07/19/superman-eyes-55-million-take-in-second-weekend-at-box-office/",
"urlToImage": "https://imageio.forbes.com/specials-images/imageserve/687b171c8f2111ce8192ae30/0x0.jpg?format=jpg&height=900&width=1600&fit=bounds",
"publishedAt": "2025-07-19T04:10:47Z",
"content": "\"Superman\" Fortress of Solitude scene.\r\nWarner Bros. Pictures/DC Studios\r\nJames Gunns Superman is looking at about a 56% drop in business from its opening weekend at the domestic box office in its se… [+3098 chars]"
},
{
"source": {
"id": null,
"name": "Tom's Hardware UK"
},
"author": "Mark Tyson",
"title": "Severance keyboard phase-shifts from sci-fi to sci-fact with launch of a new Kickstarter campaign — MDR Dasher keyboard starts at $599 and is estimated to ship from November",
"description": "Atomic Keyboards is on the verge of launching its MDR Dasher Keyboard on Kickstarter, featuring three distinct configurations.",
"url": "https://www.tomshardware.com/peripherals/mechanical-keyboards/severance-keyboard-phase-shifts-from-sci-fi-to-sci-fact-with-launch-of-a-new-kickstarter-campaign-mdr-dasher-keyboard-starts-at-usd599-and-is-estimated-to-ship-from-november",
"urlToImage": "https://cdn.mos.cms.futurecdn.net/YcXbTHkCEUUjyY9rRLFTRT.jpg",
"publishedAt": "2025-07-19T12:27:46Z",
"content": "Atomic Keyboards is on the cusp of launching its MDR Dasher Keyboard on Kickstarter. In April, we reported on this sci-fi thriller-inspired input peripheral remake becoming a limited-edition product.… [+3992 chars]"
},
{
"source": {
"id": null,
"name": "Hdblog.it"
},
"author": "HDblog.it",
"title": "Stillwater 4: il panda saggio torna su Apple TV+ | Trailer",
"description": "Arriva il trailer della stagione 4 di Stillwater. La premiata serie zen per bambini torna il 1° agosto",
"url": "https://www.hdblog.it/apple/articoli/n625873/stillwater-stagione-4-trailer-apple-tv/",
"urlToImage": "https://hd2.tudocdn.net/1275030?w=1920",
"publishedAt": "2025-07-19T11:35:00Z",
"content": "Nell'universo delle serie animate per bambini, poche riescono a unire intrattenimento e insegnamenti profondi con la stessa grazia di Stillwater. La serie, basata sulla celebre collana di libri \"Zen\"… [+1573 chars]"
},
{
"source": {
"id": null,
"name": "Hdblog.it"
},
"author": "HDblog.it",
"title": "F1 di Apple: il film con Brad Pitt sbanca il botteghino",
"description": "l film sulla Formula 1 di Apple con Brad Pitt è un successo, vicino a 350 milioni di euro",
"url": "https://www.hdblog.it/mercato/articoli/n625868/f1-film-apple-brad-pitt/",
"urlToImage": "https://hd2.tudocdn.net/1275019?w=1920",
"publishedAt": "2025-07-19T07:20:00Z",
"content": "Il successo di \"F1\", l'attesissimo film con Brad Pitt, sta segnando un punto di svolta per la strategia cinematografica di Apple. Dopo un periodo di incertezza sulla capacità dell'azienda di produrre… [+2274 chars]"
},
{
"source": {
"id": null,
"name": "Hdblog.it"
},
"author": "HDblog.it",
"title": "Meta dice no al codice AI dell'UE: scontro sulle regole",
"description": "Meta rifiuta il codice di condotta sull'AI dell'UE, citando rischi legali e per l'innovazione",
"url": "https://www.hdblog.it/mercato/articoli/n625877/meta-rifiuta-codice-ai-ue/",
"urlToImage": "https://hd2.tudocdn.net/1203388?w=1920",
"publishedAt": "2025-07-19T09:15:00Z",
"content": "Lo scontro tra i colossi tecnologici statunitensi e le autorità di regolamentazione europee si arricchisce di un nuovo capitolo, evidenziando una frizione sempre più profonda sulle politiche digitali… [+2552 chars]"
},
{
"source": {
"id": null,
"name": "ComputerBase"
},
"author": "Dennis Krause",
"title": "Nach sachdienlichem Hinweis: Apple verklagt iOS-26-Leaker, Mitarbeiter bereits entlassen",
"description": "Gerüchte begleiten den Apple-Konzern seit Dekaden, sei es das erste iPhone oder iOS 7 – Leaks zu zukünftigen Produkten und Software sind kein Novum. Nun hat ein Leaker den Bogen wohl überspannt: Apple wirft mehreren Personen vor, bewusst geistiges Eigentum üb…",
"url": "https://www.computerbase.de/news/wirtschaft/nach-sachdienlichem-hinweis-apple-verklagt-ios-26-leaker-mitarbeiter-bereits-entlassen.93576/",
"urlToImage": "https://pics.computerbase.de/1/1/8/4/9/8-37fe28354a337e7d/article-1280x720.f11cd62c.jpg",
"publishedAt": "2025-07-19T07:45:00Z",
"content": "Gerüchte begleiten den Apple-Konzern seit Dekaden, sei es das erste iPhone oder iOS 7  Leaks zu zukünftigen Produkten und Software sind kein Novum. Nun hat ein Leaker den Bogen wohl überspannt: Apple… [+7163 chars]"
},
{
"source": {
"id": null,
"name": "Antyweb.pl"
},
"author": "Kamil Świtalski",
"title": "iPhone 17 Air: właśnie poznaliśmy największą wadę nowiutkiego modelu",
"description": "Apple szykuje się do wielkiej premiery rodziny iPhone 17. W tym roku ma ona doczekać się nowego członka - i to takie, który dla wielu może okazać się wyjątkowo interesującym. Już teraz jednak mówi się o tym, co może być jego największą wadą.",
"url": "https://antyweb.pl/iphone-17-air-wlasnie-poznalismy-najwieksza-wade-nowiutkiego-modelu",
"urlToImage": "https://static.antyweb.pl/img/w_1250,h_550/wp-content/uploads/2025/02/iphone-17-air.jpg",
"publishedAt": "2025-07-19T05:00:06Z",
"content": "Wszystko wskazuje na to, e w tym roku Apple szykuje nie dwa, a trzy modele smartfonów. Jeden iPhone ma by wyjtkowy - i zupenie nowy w ich ofercie. Mowa, rzecz jasna, o iPhone 17 Air: najcieszym w rod… [+2432 chars]"
},
{
"source": {
"id": null,
"name": "Actualidadiphone.com"
},
"author": "Ángel González",
"title": "Apple integrará la monitorización de ritmo cardíaco en los AirPods Pro 3 tras su llegada a los Powerbeats Pro 2",
"description": "Apple prepara los AirPods Pro 3 con sensor de ritmo cardíaco tras su estreno en los Powerbeats Pro 2. Conoce las ventajas y novedades que llegan.",
"url": "https://www.actualidadiphone.com/apple-integrara-la-monitorizacion-de-ritmo-cardiaco-en-los-airpods-pro-3-tras-su-llegada-a-los-powerbeats-pro-2/",
"urlToImage": "https://www.actualidadiphone.com/wp-content/uploads/2022/10/AirPods-Pro-2-3.jpg",
"publishedAt": "2025-07-19T08:00:55Z",
"content": "La tecnología avanza a pasos agigantados y el mundo de los auriculares inalámbricos no se queda atrás. Apple está preparando una auténtica revolución en la próxima generación de sus AirPods Pro, cono… [+5396 chars]"
},
{
"source": {
"id": null,
"name": "Actualidadiphone.com"
},
"author": "Cristian Garcia",
"title": "Cómo proteger tu salud visual con “Distancia de la pantalla” en tu iPhone",
"description": "Descubre cómo proteger tu salud visual con “Distancia de la pantalla” en tu iPhone. Guía completa, consejos y pasos para activar la función.",
"url": "https://www.actualidadiphone.com/como-proteger-tu-salud-visual-con-distancia-de-la-pantalla-en-tu-iphone/",
"urlToImage": "https://www.actualidadiphone.com/wp-content/uploads/2022/09/iPhone-4-Pantalla-Always-On.jpg",
"publishedAt": "2025-07-19T12:29:27Z",
"content": "En la era actual, el uso intensivo de smartphones y dispositivos electrónicos se ha convertido en parte esencial de nuestro día a día. Sin embargo, pasar largos periodos frente a la pantalla puede af… [+11664 chars]"
},
{
"source": {
"id": null,
"name": "Actualidadiphone.com"
},
"author": "Cristian Garcia",
"title": "Guía completa para dominar los gestos en modelos de iPhone con Face ID",
"description": "Descubre todos los gestos y trucos para manejar tu iPhone con Face ID. Guía completa y práctica para usuarios de todos los niveles.",
"url": "https://www.actualidadiphone.com/como-dominar-los-gestos-en-modelos-de-iphone-con-face-id/",
"urlToImage": "https://www.actualidadiphone.com/wp-content/uploads/2025/07/Como-dominar-los-gestos-en-modelos-de-iPhone-con-Face-ID.jpg",
"publishedAt": "2025-07-19T12:31:23Z",
"content": "Los gestos en el iPhone con Face ID han cambiado por completo la manera en la que interactuamos con nuestro móvil. Desde que Apple eliminó el clásico botón de inicio físico, la navegación pasó a depe… [+13221 chars]"
},
{
"source": {
"id": null,
"name": "Actualidadiphone.com"
},
"author": "Cristian Garcia",
"title": "Cómo personalizar el centro de control de tu iPhone al detalle",
"description": "Descubre cómo personalizar el centro de control en tu iPhone y aprovecha todas las novedades de iOS 18.",
"url": "https://www.actualidadiphone.com/como-personalizar-el-centro-de-control-en-tu-iphone/",
"urlToImage": "https://www.actualidadiphone.com/wp-content/uploads/2024/06/Centro-de-Control-e1719768322498.jpg",
"publishedAt": "2025-07-19T12:33:41Z",
"content": "Personalizar el Centro de Control del iPhone se ha convertido en una de las prioridades para muchos usuarios tras la llegada de iOS 18. Apple ha renovado completamente esta herramienta, aportando muc… [+10584 chars]"
},
{
"source": {
"id": null,
"name": "L'Express"
},
"author": "Charlotte Baris, Charlotte Lalanne, Etienne Girard, Alexandra Saviana",
"title": "Entre la France et l'Algérie, soixante ans de guerres d'espionnage",
"description": "Derrière la crise diplomatique entre Alger et Paris se jouent aussi des batailles secrètes. Retour dans notre série de podcasts sur toutes les passes d'armes entre espions, de la guerre d'Algérie à aujourd'hui.",
"url": "https://www.lexpress.fr/monde/entre-la-france-et-lalgerie-soixante-ans-de-guerres-despionnage-JD2XJYYEAJCX5BJ5SOKRQBJAYA/",
"urlToImage": "https://www.lexpress.fr/resizer/v2/AYNUMAY2I5HSFBYTZRKNZ7SPGQ.jpg?auth=56af6f236ee82b88eedf43de429f4d562ec16d58e8beb84106124304357ed9e0&width=1200&height=630&quality=85&focal=2821%2C3565",
"publishedAt": "2025-07-19T07:00:00Z",
"content": "Depuis lété dernier, les relations diplomatiques entre la France et lAlgérie ne cessent de se dégrader. Derrière cette crise diplomatique officielle, se cache aussi une guerre secrète : celle des esp… [+2000 chars]"
},
{
"source": {
"id": null,
"name": "Tinhte.vn"
},
"author": "no-reply@tinhte.vn (Gà BK), Gà BK",
"title": "Apple Watch tương lai: Digital Crown sẽ sử dụng cảm biến chạm, ánh sáng thay vì cơ học?",
"description": "Chiếc Digital Crown (núm xoay) từ lâu đã trở thành biểu tượng đặc trưng của Apple Watch, được nhiều người dùng ưa thích vì cảm giác tương tác vật lý trực quan và chắc chắn. Tuy nhiên, theo  AppleInsider, cùng với các bằng sáng chế mới được công bố…",
"url": "https://tinhte.vn/thread/apple-watch-tuong-lai-digital-crown-se-su-dung-cam-bien-cham-anh-sang-thay-vi-co-hoc.4038004/",
"urlToImage": "https://photo2.tinhte.vn/data/attachment-files/2025/07/8785155_34433-119544-000-lead-Digital-Crown-xl.jpg",
"publishedAt": "2025-07-19T01:31:33Z",
"content": "Chic Digital Crown (núm xoay) t lâu ã tr thành biu tng c trng ca Apple Watch, c nhiu ngi dùng a thích vì cm giác tng tác vt lý trc quan và chc chn. Tuy nhiên, theo AppleInsider, cùng vi các bng sáng … [+1172 chars]"
},
{
"source": {
"id": null,
"name": "redmondpie.com"
},
"author": "Oliver Haslam",
"title": "The Cleanest Windows 11 Experience – Get LTSC Full Version For Just $10!",
"description": "Looking to Windows 11 cdkeyWindows 11 cdkey? With Windows 10 support set to end very soon, there's never been a better time to look into buying a Windows 11 key. Especially with VIP-CDKDeals offering some incredibly low prices.\nThe post The Cleanest Windows 1…",
"url": "https://www.redmondpie.com/the-cleanest-windows-11-experience-get-ltsc-full-version-for-just-10/",
"urlToImage": "https://cdn.redmondpie.com/wp-content/uploads/2025/07/LTSC1.jpeg",
"publishedAt": "2025-07-19T00:06:13Z",
"content": "Looking to Windows 11 cdkey? With Windows 10 support set to end very soon, there’s never been a better time to look into buying a Windows 11 key. Especially with VIP-CDKDeals offering some incredibly… [+2685 chars]"
},
{
"source": {
"id": null,
"name": "3dnews.ru"
},
"author": null,
"title": "Эра электромобилей откладывается: автопроизводители массово отменяют и замораживают EV-проекты",
"description": "В 2025 году крупные автопроизводители начали массово отказываться от своих амбициозных планов по выпуску электромобилей, которые ещё пару лет назад казались весьма перспективными. Причиной стали снижение спроса, изменения в государственной политике и сбои в ц…",
"url": "https://3dnews.ru/1126229/era-elektromobiley-otkladivaetsya-avtoproizvoditeli-massovo-otmenyayut-ili-zamoragivayut-evproekti",
"urlToImage": "https://3dnews.ru/assets/external/illustrations/2025/07/19/1126229/volvo-all-ev.jpg",
"publishedAt": "2025-07-19T12:11:00Z",
"content": "2025 , . , .\r\nVolvo All-EV. : Volvo\r\n, , , Honda, Nissan, Volvo, Mercedes-Benz Stellantis, EV-. , , Wired.\r\n . Mercedes-Benz Volvo 2030 , General Motors — 2035 . , , . .\r\nAlixPartners, 2030 46 % . (M… [+396 chars]"
},
{
"source": {
"id": null,
"name": "Everything-everywhere.com"
},
"author": "Gary Arndt",
"title": "The Sinking of the Mignonette and Justified Cannibalism",
"description": "Podcast Transcript On May 19, 1884, a small yacht containing four men set sail from England to Australia.  On July 5th, the ship was hit by a massive wave and capsized.  The crew escaped the shipwreck on a lifeboat, but was left in a horrible situation. They …",
"url": "https://everything-everywhere.com/the-sinking-of-the-mignonette-and-justified-cannibalism/",
"urlToImage": "https://photos.smugmug.com/Other/n-hRFP2/Podcast-Images/i-XmR3NHn/1/MjZc9cfr9kkC27NSRWQHwMjW8NpnLPnVmxNPNVJxh/L/1839epart-L.jpg",
"publishedAt": "2025-07-19T04:46:25Z",
"content": "Subscribe Apple | Spotify | Amazon |iHeart Radio | Castbox | Podcast Republic | RSS | Patreon\r\nOn May 19, 1884, a small yacht containing four men set sail from England to Australia. \r\nOn July 5th, th… [+14224 chars]"
},
{
"source": {
"id": null,
"name": "Cult of Mac"
},
"author": "David Snow",
"title": "Best tech gifts for travelers",
"description": "Not all gifts for travelers are no-brainers, like AirTag. Peruse our selection of cool tech accessories for the avid traveler in your life. \n(via Cult of Mac - Your source for the latest Apple news, rumors, analysis, reviews, how-tos and deals.)",
"url": "https://www.cultofmac.com/buying-guides/gifts-for-travelers",
"urlToImage": "https://cdn.cultofmac.com/wp-content/uploads/2025/05/Best-tech-gifts-for-travelers.jpg",
"publishedAt": "2025-07-19T13:00:18Z",
"content": "Tech travel accessories have become essential companions for modern travelers who rely on their Apple and other devices for everything from navigation to entertainment. Ever found yourself with a dea… [+24943 chars]"
},
{
"source": {
"id": null,
"name": "Roomie.jp"
},
"author": "machi-ya commerce（かいサポ）",
"title": "スーツにも合う美しさ。スマホ＆Apple Watchをオーダーメイドのルガトー革で飾ってみた",
"description": "※こちらは「かいサポ（お買いものサポーターチーム）」が編集・執筆した記事です。 Photographed by Haruki Matsumoto “オーダーメイドのスマホケース”って聞くと、贅沢すぎる気がしませんか？ でも実際に使ってみるとその価値は想像以上でした。 今回試したのは、ベルギー産で革の宝石とも呼ばれるヌメ革「ルガトー製のスマホケース＆Apple Watchバンド」。一部を除いた大半の",
"url": "https://www.roomie.jp/2025/07/1559054/",
"urlToImage": "https://media.loom-app.com/roomie/dist/images/2025/07/TOP-58-scaled.jpg?w=1200",
"publishedAt": "2025-07-19T06:45:47Z",
"content": "Photographed by Haruki Matsumoto \r\nApple Watch\r\n7000\r\niPhoneApple Watch\r\n2\r\niPhone 16\r\n0.6mm\r\nIC\r\nD\r\nApple Watch\r\nApple WatchPixel Watch\r\nApple Watch\r\nOKApple Watch\r\nmachi-ya\r\n20OFF6,88020OFF9,440\r\nW… [+33 chars]"
},
{
"source": {
"id": null,
"name": "Twistedsifter.com"
},
"author": "Heide Lazaro",
"title": "Husband Was Trying To Understand Why His Wife Got Into Debt, But She Got Defensive And Refused To Explain Her Spending",
"description": "Open communication is key to financial trust in any relationship.",
"url": "http://twistedsifter.com/2025/07/man-was-trying-to-understand-why-his-wife-got-into-debt-but-she-got-defensive-and-refused-to-explain-her-spending/",
"urlToImage": "https://twistedsifter.com/wp-content/uploads/2025/06/Twisted-Sifter-1120.jpg",
"publishedAt": "2025-07-19T08:24:48Z",
"content": "Pexels/Reddit\r\nFinancial transparency is vital in any marriage, even if you have separate accounts.\r\nIf your spouse complained that they were in debt, would you be upset if they refused to tell you a… [+2524 chars]"
},
{
"source": {
"id": null,
"name": "Zive.cz"
},
"author": "Stanislav Janů",
"title": "Jablko z druhé ruky. Co je dobré pohlídat při nákupu telefonů, tabletů a počítačů Apple v bazaru",
"description": "Ekosystém Applu je lákavý, má však zásadní nevýhodu, která většinou v přechodu zabrání – cenu. Ať už jde o iPhony, Macy, nebo tablety iPad, vstupní bariéru sníží bazarový nákup.",
"url": "https://www.zive.cz/clanky/jablko-z-druhe-ruky-co-je-dobre-pohlidat-pri-nakupu-telefonu-tabletu-a-pocitacu-apple-v-bazaru/sc-3-a-235893/default.aspx",
"urlToImage": "https://www.zive.cz/getthumbnail.aspx?q=100&height=20000&width=20000&id_file=876169599",
"publishedAt": "2025-07-19T07:45:00Z",
"content": "Ekosystém Applu je lákavý, má vak zásadní nevýhodu, která vtinou v pechodu zabrání cenu. A u jde o iPhony, Macy, nebo tablety iPad, vstupní bariéru sníí bazarový nákup.Nákup elektroniky z druhé ruky … [+1298 chars]"
},
{
"source": {
"id": null,
"name": "Macitynet.it"
},
"author": "Fabrizio Frattini",
"title": "L’iPhone 17 Air con mini batteria significherà mini autonomia?",
"description": "Apple prepara un iPhone ultrasottile con batteria da appena 2.800 mAh. Il rischio è quello di una autonomia inaccettabile peggiore di quella del criticato Samsung Galaxy 25 Edge. Ma Cupertino ha diversi assi nella manica da giocare\n- su macitynet.it L’iPhone …",
"url": "https://www.macitynet.it/batteria-iphone-17-air/",
"urlToImage": "https://www.macitynet.it/wp-content/uploads/2020/11/batteria-iphone-12-mini-scaled.jpeg",
"publishedAt": "2025-07-19T11:29:23Z",
"content": "Quanto può durare uno smartphone moderno, con refresh a 120 Hz, schermo da 6,6 pollici, 5G, se la sua batteria è quella di un iPhone 12? Potremmo scoprirlo presto se, come pare, iPhone 17 Air avesse … [+2959 chars]"
},
{
"source": {
"id": null,
"name": "Macitynet.it"
},
"author": "Mauro Notarianni",
"title": "Vendite Mac in crescita del +13% secondo Counterpoint Research",
"description": "Nel secondo trimestre 2025 le spedizioni globali di PC sono cresciute dell'8,8% anno su anno e Apple, Lenovo e Asus evidenziando ciascuna una crescita di oltre il 10% rispetto allo stesso periodo dello scorso anno.\n- su macitynet.it Vendite Mac in crescita de…",
"url": "https://www.macitynet.it/vendite-mac-secondo-trimestre-2025/",
"urlToImage": "https://www.macitynet.it/wp-content/uploads/2022/07/LogoAPplegenrico.jpg",
"publishedAt": "2025-07-19T06:59:45Z",
"content": "Nel secondo trimestre 2025 le spedizioni globali di PC sono cresciute dell’8,8% anno su anno e Apple, Lenovo e Asus evidenziando ciascuna una crescita di oltre il 10% rispetto allo stesso periodo del… [+1423 chars]"
},
{
"source": {
"id": null,
"name": "Macitynet.it"
},
"author": "Fabrizio Frattini",
"title": "Un vetro antiriflesso e anti graffi per iPhone 17 Pro",
"description": "Attesa da più di un anno, la tecnologia anti-riflesso e anti-graffio per il vetro degli iPhone, torna in corsa per iPhone 17 Pro. Potrebbe essere la stessa componente usata da Samsung per i Galaxy S24 Ultra o forse una ancora più innovativa.\n- su macitynet.it…",
"url": "https://www.macitynet.it/un-vetro-antiriflesso-e-anti-graffi-per-iphone-17-pro/",
"urlToImage": "https://www.macitynet.it/wp-content/uploads/2025/04/iphone-gorilla.jpg",
"publishedAt": "2025-07-19T10:29:35Z",
"content": "Quando si parla di iPhone, le promesse tecnologiche non sempre coincidono con i tempi del marketing ma spesso, prima o poi, alcune di esse annunciate, rinviate, poi annunciate di nuovo e ancora cance… [+2263 chars]"
},
{
"source": {
"id": null,
"name": "Yahoo Entertainment"
},
"author": null,
"title": "Forget About Share Buybacks and Dividends: Here Is How Apple Can Win Growth Investors Back",
"description": null,
"url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_b7cb2034-45f9-4da8-a17d-275ec44e93a1",
"urlToImage": null,
"publishedAt": "2025-07-19T12:15:00Z",
"content": "If you click 'Accept all', we and our partners, including 236 who are part of the IAB Transparency &amp; Consent Framework, will also store and/or access information on a device (in other words, use … [+714 chars]"
},
{
"source": {
"id": null,
"name": "Yahoo Entertainment"
},
"author": "Ghazal Ahmed",
"title": "Meta’s AI Innovations Drive $850 Price Target as Analysts See Strong Q2 Ahead",
"description": "Meta Platforms, Inc. (NASDAQ:META) is one of the Trending AI Stocks in Focus This Week. On July 16, Canaccord Genuity analyst Maria Ripps raised the price...",
"url": "https://finance.yahoo.com/news/meta-ai-innovations-drive-850-111109598.html",
"urlToImage": "https://media.zenfs.com/en/insidermonkey.com/5aa30f6ecf653eb01c521d097b0645bc",
"publishedAt": "2025-07-19T11:11:09Z",
"content": "Meta Platforms, Inc. (NASDAQ:META) is one of the Trending AI Stocks in Focus This Week. On July 16, Canaccord Genuity analyst Maria Ripps raised the price target on the stock to $850.00 (from $825.00… [+2431 chars]"
},
{
"source": {
"id": null,
"name": "Hwupgrade.it"
},
"author": null,
"title": "Scompiglio nei listini Amazon: prezzi impossibili per TV OLED, Amazfit GTR 3 (69), drone DJI 159, robot e altre assurdità",
"description": "Gli articoli di Amazon più scontati, nel settore della tecnologia, li trovate in questo articolo. Sono super aggiornati, anche perché li controlliamo tutti i giorni. iPhone, scope elettriche, droni, portatili... c'è veramente di tutto.",
"url": "https://www.hwupgrade.it/news/multimedia/scompiglio-nei-listini-amazon-prezzi-impossibili-per-tv-oled-amazfit-gtr-3-69-drone-dji-159-robot-e-altre-assurdita_141310.html",
"urlToImage": "https://www.hwupgrade.it/i/n/jabraelite4_720.jpg",
"publishedAt": "2025-07-19T08:31:13Z",
"content": "Amazon è più agguerrita che mai con gli sconti, in questi giorni. \r\nParliamo del settore tecnologia, in altri ambiti non lo sappiamo, ma quel che è \r\ncerto è che se cercate TV, smartphone (iPhone com… [+10116 chars]"
},
{
"source": {
"id": null,
"name": "Trendencias.com"
},
"author": "Joel Calata",
"title": "TikTok ha descubierto que las Timberland son el calzado más versátil por una razón: al cortar sus botas se convierten en mocasines",
"description": "No es nuevo que, para las marcas de calzado deportivo, los mocasines se hayan convertido en la nueva obsesión: sólo basta con ver los modelos que ha lanzado Nike, New Balance y hasta Converse para darse cuenta de que compiten junto a las zapatillas para conve…",
"url": "https://www.trendencias.com/hombres/tiktok-ha-descubierto-que-timberland-calzado-versatil-razon-al-cortar-sus-botas-se-convierten-mocasines",
"urlToImage": "https://i.blogs.es/f8e3d7/ps---plantilla-portadas-xtk-copia/840_560.jpeg",
"publishedAt": "2025-07-19T13:01:34Z",
"content": "No es nuevo que, para las marcas de calzado deportivo, los mocasines se hayan convertido en la nueva obsesión: sólo basta con ver los modelos que ha lanzado Nike, New Balance y hasta Converse para da… [+2429 chars]"
},
{
"source": {
"id": null,
"name": "Slate Magazine"
},
"author": "Emily Peck, Felix Salmon, and Elizabeth Spiers",
"title": "New New Coke?",
"description": "MAHA has entered the Coca-Cola chat.",
"url": "https://slate.com/podcasts/slate-money/2025/07/business-maha-brand-new-coke-credit-scores-donald-trump-holidays",
"urlToImage": "https://compote.slate.com/images/0ad4cce0-1643-405e-b092-a65cc2f24b9e.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560",
"publishedAt": "2025-07-19T09:00:00Z",
"content": "This week: A judge has blocked a Biden era rule that would prevent medical debt from affecting credit scores. Felix Salmon, Elizabeth Spiers, and Emily Peck discuss the logic behind the proposed rule… [+1062 chars]"
},
{
"source": {
"id": null,
"name": "Slate Magazine"
},
"author": "Dahlia Lithwick",
"title": "The SCOTUS Guide To Building A Police State",
"description": "The conservative majority on the Roberts court’s immigration record is eerily Trump-aligned",
"url": "https://slate.com/podcasts/amicus/2025/07/raids-deploying-the-military-detention-camps-and-third-country-deportations-how-the-supreme-court-got-on-board-with-trumps-most-extreme-immigration-tactics",
"urlToImage": "https://compote.slate.com/images/24c63d16-8900-46e1-a529-a8c4f6aeab2d.png?crop=1080%2C720%2Cx100%2Cy0&width=1560",
"publishedAt": "2025-07-19T09:00:00Z",
"content": "Over the last six months, life has been upended for millions of people in America as Stephen Millers extreme immigration policies have been unleashed. And while the first weeks of the second Trump ad… [+956 chars]"
},
{
"source": {
"id": null,
"name": "Slate Magazine"
},
"author": "Dahlia Lithwick and Mark Joseph Stern",
"title": "SCOTUS Shadow Docket Greenlights Trump’s Lawlessness Again",
"description": "The Supreme Court’s accidental roadmap for firing the Fed Chair.",
"url": "https://slate.com/podcasts/amicus/2025/07/not-for-donald-trumps-eyes-how-jerome-powell-could-be-fired-legally",
"urlToImage": "https://compote.slate.com/images/f4e3d319-c190-45e4-b68c-d46c3b28c3e3.jpeg?width=1560",
"publishedAt": "2025-07-19T09:00:00Z",
"content": "In this member-exclusive episode of Amicus, Dahlia Lithwick and co-host Mark Joseph Stern discuss the Supreme Courts shadow docket decision in the case of McMahon v New York, an unexplained order per… [+819 chars]"
},
{
"source": {
"id": null,
"name": "MacGeneration"
},
"author": "Stéphane Moussie",
"title": "Sortie de veille : Safari éclipsé par Comet ? Notre avis sur le navigateur de Perplexity",
"description": "Toutes les semaines, écoutez Sortie de veille, le podcast hebdomadaire de MacGeneration ! On débat de l'actualité Apple et tech des derniers jours en une quinzaine de minutes.\n\nAprès avoir dépoussiéré la recherche en ligne, Perplexity s’attaque aux navigateur…",
"url": "https://www.macg.co/podcasts/2025/07/sortie-de-veille-safari-eclipse-par-comet-notre-avis-sur-le-navigateur-de-perplexity-302615",
"urlToImage": "https://cdn.mgig.fr/2025/07/mga-d96bc750-w375-w1500-w750_accroche.jpg",
"publishedAt": "2025-07-19T06:00:00Z",
"content": "Toutes les semaines, écoutez Sortie de veille, le podcast hebdomadaire de MacGeneration ! On débat de l'actualité Apple et tech des derniers jours en une quinzaine de minutes.\r\nAprès avoir dépoussiér… [+912 chars]"
},
{
"source": {
"id": null,
"name": "Screen Rant"
},
"author": "Kevin Pantoja",
"title": "Chris Evans & Ana De Armas Have Quietly Become One Of Hollywood's Best On-Screen Duos",
"description": "Ana de Armas and Chris Evans have shined together on the screen in a trio of movies where their chemistry has often been the highlight of the film.",
"url": "https://screenrant.com/chris-evans-ana-de-armas-great-acting-duo/",
"urlToImage": "https://static1.srcdn.com/wordpress/wp-content/uploads/2023/04/adrien-brody-ghosted-movie-3.jpg",
"publishedAt": "2025-07-19T10:35:19Z",
"content": "There are some male/female duos in Hollywood who just go together thanks to their electric chemistry, from Meg Ryan and Tom Hanks to Ryan Gosling and Emma Stone, but Chris Evans and Ana de Armas are … [+3234 chars]"
},
{
"source": {
"id": null,
"name": "Bringatrailer.com"
},
"author": "bringatrailer",
"title": "18k-Mile Turbocharged 1997 Acura NSX-T 6-Speed",
"description": "This 1997 Acura NSX-T shows 18k miles and has been fitted with an AP-X turbocharger kit, a Tial blow-off valve, aftermarket suspension and audio components, an upgraded fueling system, an AEM throttle body and engine-management system, a methanol-injection sy…",
"url": "https://bringatrailer.com/listing/1997-acura-nsx-t-21/",
"urlToImage": "https://bringatrailer.com/wp-content/uploads/2025/06/1997_acura_nsx-t_nsx-52-99843.jpeg",
"publishedAt": "2025-07-19T12:25:08Z",
"content": "This 1997 Acura NSX-T shows 18k miles and has been fitted with an AP-X turbocharger kit, a Tial blow-off valve, aftermarket suspension and audio components, an upgraded fueling system, an AEM throttl… [+2921 chars]"
},
{
"source": {
"id": null,
"name": "Ipadizate.com"
},
"author": "Sergio J. Ortiz",
"title": "5 maravillosas funciones de iOS 26 para inspirar tu alma creativa",
"description": "iOS 26 ya está aquí o, al menos, su versión beta. La nueva actualización de software con el rediseño del material Liquid Glass es una de las más importantes de la historia. Pero no incluye única y exclusivamente un lavado de cara en su interfaz de usuario, ta…",
"url": "https://ipadizate.com/ios/funciones-creatividad-ios-26-iphone",
"urlToImage": "https://ipadizate.com/hero/2025/07/ios-26-iphone-4.1749795136.7455.1750747427.4261.1752566979.1959.1752760431.3451.jpg?width=1200",
"publishedAt": "2025-07-19T12:00:27Z",
"content": "La actualización de iOS 26 se lanzará en septiembre\r\niOS 26 ya está aquí o, al menos, su versión beta. La nueva actualización de software con el rediseño del material Liquid Glass es una de las más i… [+4400 chars]"
},
{
"source": {
"id": null,
"name": "New York Post"
},
"author": "Tina Moore",
"title": "Son of Sam’s first shooting victim, now 88, shaken by sudden encounter with killer’s disciple",
"description": "A woman who was shot by \"Son of Sam\" killer David Berkowitz nearly 60 years ago found herself in the crosshairs again recently when she was confronted by an acolyte of the serial killer who raged to her about the murderer’s innocence.",
"url": "https://nypost.com/2025/07/19/us-news/son-of-sam-didnt-do-it-his-pal-tells-shooting-victim/",
"urlToImage": "https://nypost.com/wp-content/uploads/sites/2/2025/07/108378024.jpg?quality=75&strip=all&w=1024",
"publishedAt": "2025-07-19T12:45:00Z",
"content": "A woman shot by “Son of Sam” killer David Berkowitz nearly 60 years ago found herself in the crosshairs again this week when she was confronted by an acolyte of the serial killer who lectured her abo… [+4049 chars]"
},
{
"source": {
"id": null,
"name": "STERN.de"
},
"author": "STERN.de",
"title": "Wissenschaft: Hoch: Datenschutzniveau auf europäischen Standard senken",
"description": "Auch bei wissenschaftlichen Datenbanken sei nicht mehr unbedingt Verlass auf die USA, sagt der Minister. Er beobachtet noch an ganz anderer Stelle Folgen der Entwicklungen jenseits des Atlantiks.",
"url": "https://www.stern.de/gesellschaft/regional/rheinland-pfalz-saarland/wissenschaft--hoch--datenschutzniveau-auf-europaeischen-standard-senken-35906284.html",
"urlToImage": "https://image.stern.de/35906286/t/_R/v1/w1440/r1.7778/-/19--vhtzr34vz6v6axs2048jpeg---1056b190bb5a29de.jpg",
"publishedAt": "2025-07-19T02:00:39Z",
"content": "Kopiere den aktuellen Link\r\nZur Merkliste hinzufügen\r\nAuch bei wissenschaftlichen Datenbanken sei nicht mehr unbedingt Verlass auf die USA, sagt der Minister. Er beobachtet noch an ganz anderer Stell… [+2404 chars]"
},
{
"source": {
"id": null,
"name": "Begeek.fr"
},
"author": "Jordan Servan",
"title": "Apple s’attaque aux leaks : Jon Prosser visé par une plainte explosive",
"description": "Apple a engagé une action en justice contre le vidéaste Jon Prosser, l’accusant d’avoir dérobé des informations confidentielles sur la prochaine version du système d’exploitation iOS 26, révélant ainsi des tensions croissantes entre la firme et certains créat…",
"url": "https://www.begeek.fr/apple-sattaque-aux-leaks-jon-prosser-vise-par-une-plainte-explosive-418571",
"urlToImage": "https://www.begeek.fr/app/uploads/2024/12/Apple.jpg",
"publishedAt": "2025-07-19T06:00:59Z",
"content": "Apple a engagé une action en justice contre le vidéaste Jon Prosser, laccusant davoir dérobé des informations confidentielles sur la prochaine version du système dexploitation iOS 26, révélant ainsi … [+3737 chars]"
},
{
"source": {
"id": "cbs-news",
"name": "CBS News"
},
"author": "Kerry  Breen",
"title": "Kayem Foods recalls over 24,000 pounds of chicken sausage products",
"description": "The ready-to-eat sausage products may be contaminated with pieces of plastic, the USDA Food Safety and Inspection Service said.",
"url": "https://www.cbsnews.com/news/kayem-foods-inc-recall-chicken-sausage-plastic-pieces/",
"urlToImage": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/07/19/b3dc03aa-1dab-4cf6-9cc2-cf28d46c4a74/thumbnail/1200x630/a7b64cb61d7f40c166df40c014c364e2/screenshot-2025-07-19-at-9-24-18-am.png",
"publishedAt": "2025-07-19T13:44:04Z",
"content": "Kayem Foods Inc. is recalling over 24,000 pounds of ready-to-eat chicken sausage products that may be contaminated with pieces of plastic, the U.S. Department of Agriculture's Food Safety and Inspect… [+1392 chars]"
},
{
"source": {
"id": null,
"name": "Fashionsnap.com"
},
"author": null,
"title": "なぜイノベーションは“よそ者”から生まれるのか　多様性と革新の関係",
"description": "シリコンバレーで仕事をしていると、日常的に多様な国籍・文化・価値観に触れる。そこには、自分とまったく違うバックグラウンドを持つ人たちが、当然のように議論し、協力し、そしてぶつかり合っているのを肌で感じる。 日本ではなかなか経験することのないレベルの価値観の異なる人たちとのディスカッション。時には険悪なムードになりながらも、最終的にはお互いを理解し合いながらも、課題に対して、最適な解決策を探し... このコンテンツは FASHIONSNAP が配信しています。",
"url": "https://www.fashionsnap.com/article/2025-07-19/silicon-valley-2025/",
"urlToImage": "https://fashionsnap-assets.com/asset/format=auto,width=1280,height=670,gravity=center/article/images/2025/07/diversity-main-89e11130-9a5a-4623-bf9c-f40e4f14d1ee.jpg",
"publishedAt": "2025-07-19T09:59:00Z",
"content": "<ul><li>Tesla CEOSpaceX CEONeuralinkThe Boring Company</li><li>PayPalFacebookPalantir Technologies</li><li>GoogleGoogle</li><li>NVIDIACEOGPUAI</li><li>Yahoo!10Yahoo!</li><li>Apple</li><li>HuffPostThe… [+399 chars]"
},
{
"source": {
"id": null,
"name": "Yahoo Entertainment"
},
"author": "Cynthia Measom",
"title": "Target Is Opening 8 New Stores in Summer 2025: Here’s Where and When",
"description": "Target will open 8 new stores this summer, including major locations in New York and California featuring CVS, Starbucks, Apple at Target & fresh grocery.",
"url": "https://www.yahoo.com/news/target-opening-8-stores-summer-100331855.html",
"urlToImage": "https://s.yimg.com/ny/api/res/1.2/CowTHbFyh0z8csOTarpimQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/gobankingrates_644/914df6da27779404fe64da8faf735d63",
"publishedAt": "2025-07-19T10:03:31Z",
"content": "Target has big plans over the next decade, with more than 300 new stores in the works. In the short term, the big-box retailer is opening eight new stores over the summer, a few of which exceed the c… [+3365 chars]"
},
{
"source": {
"id": null,
"name": "CHIP Online Deutschland"
},
"author": "Carina Blumenroth",
"title": "Nach 13 Jahren: Google führt endlich langersehnte Funktion ein",
"description": "Lange haben Nutzer darauf gewartet, jetzt könnte Google die Funktion bringen. In Google Keep soll es bald möglich sein, innerhalb der Notiz zu suchen.",
"url": "https://www.chip.de/news/nach-13-jahren-soll-die-funktion-kommen-google-fuehrt-endlich-langersehntes-feature-ein_83290c35-8ba0-441f-af29-6fc571744b18.html",
"urlToImage": "https://quadro.burda-forward.de/ctf/3ce70ae1-e59e-45fb-9319-2d6d3155cda2.31b049aa-da45-4f79-a1ee-fd59c97caa3d.png?im=RegionOfInterestCrop%3D%281200%2C630%29%2CregionOfInterest%3D%281122%2C859%29&hash=eed7932207d6731cf597344d8c95c19c4135cf88cbb266d51edf3c5de1143a01",
"publishedAt": "2025-07-19T04:36:00Z",
"content": "Google Keep verbessert sich  wer die App für lange Notizen nutzt, weiß, dass es innerhalb einer Notiz schwer wird, etwas wiederzufinden. Doch das könnte sich bald ändern. Denn man soll innerhalb eine… [+1243 chars]"
},
{
"source": {
"id": null,
"name": "Iphon.fr"
},
"author": "Sami Trabcha",
"title": "iOS 26 : elle s’appelle “Aperçu”, mais personne ne l’a vue venir",
"description": "Tout savoir sur cette nouvelle application native pour iPhone et iPad.",
"url": "https://www.iphon.fr/post/presentation-app-apercu-ios-26-ipados",
"urlToImage": "https://www.iphon.fr/app/uploads/2025/06/ios-26-iphone-ecran-veoruillage-min-1600x900.jpg",
"publishedAt": "2025-07-19T10:41:56Z",
"content": "Apple a présenté iOS 26 lors de la WWDC 2025 en juin dernier. Parmi les annonces, certaines fonctionnalités prometteuses sont passées sous le radar médiatique, mais elles méritent pourtant plus d’att… [+3049 chars]"
},
{
"source": {
"id": null,
"name": "Paul Tan's Automotive News"
},
"author": "Mohd Farid Awaludin",
"title": "GAC Emkoo dipamer untuk umum di PACE 2025 – SUV segmen-C CKD bermula RM120k, 1.5 TGDI, 7DCT",
"description": "Sebelum dilancarkan secara rasmi pada pasaran tempatan, GAC Malaysia hari ini mempamerkan SUV segmen-C GAC Emkoo kepada orang awam ketika berlangsungnya acara paultan.org Premium Auto Car Expo (PACE) 2025, yang diadakan di Pusat Konvensyen Setia City (SCCC) b…",
"url": "https://paultan.org/2025/07/19/gac-emkoo-dipamer-untuk-umum-di-pace-2025-suv-segmen-c-ckd-bermula-rm120k-1-5-tgdi-7dct/",
"urlToImage": "https://paultan.org/image/2025/07/2025-PACE-GAC_Emkoo-Ext-1_BM-1200x801.jpg",
"publishedAt": "2025-07-19T02:14:47Z",
"content": "Sebelum dilancarkan secara rasmi pada pasaran tempatan, GAC Malaysia hari ini mempamerkan SUV segmen-C GAC Emkoo kepada orang awam ketika berlangsungnya acara paultan.org Premium Auto Car Expo (PACE)… [+2399 chars]"
},
{
"source": {
"id": null,
"name": "Paul Tan's Automotive News"
},
"author": "Danny Tan",
"title": "GAC Emkoo public preview at PACE 2025 – C-segment SUV with 1.5 TGDI, 7-speed DCT; CKD from RM120k",
"description": "GAC Malaysia is having a public preview of the GAC Emkoo at the paultan.org Premium Auto Car Expo (PACE) 2025, which is being held at the Setia City Convention Centre this weekend, July 19–20. Distributor […]\nThe post GAC Emkoo public preview at PACE 2025 – C…",
"url": "https://paultan.org/2025/07/19/gac-emkoo-public-preview-at-pace-2025-c-segment-suv-with-1-5-tgdi-7-speed-dct-ckd-from-rm120k/",
"urlToImage": "https://paultan.org/image/2025/07/2025-PACE-GAC_Emkoo-Ext-1-1200x801.jpg",
"publishedAt": "2025-07-19T01:52:14Z",
"content": "GAC Malaysia is having a public preview of the GAC Emkoo at the paultan.org Premium Auto Car Expo (PACE) 2025, which is being held at the Setia City Convention Centre this weekend, July 1920. Distrib… [+1867 chars]"
},
{
"source": {
"id": null,
"name": "Technews.tw"
},
"author": "Atkinson",
"title": "蘋果對面板供應商 LG Display 及三星砍價，避免新款 iPhone 漲價太多影響買氣",
"description": "外媒報導，蘋果正向其主要顯示器供應商三星和 LG 施壓，要求它們降低價格，以應對美國關稅帶來的成本壓力，並避免即將推出的 iPhone 17 系列售價過高，給消費者帶來過大的價格震驚。 根據 Phonearena 的報導，美國總統川普曾明確表示，如果蘋果繼續在海外生產手機，然後將其進口到美國銷售，他...",
"url": "https://finance.technews.tw/2025/07/19/apple-cuts-prices-with-panel-suppliers-lg-display-and-samsung/",
"urlToImage": "https://img.technews.tw/wp-content/uploads/2024/09/10083017/Apple-iPhone-16-Pro-hero-240909.jpg",
"publishedAt": "2025-07-19T07:00:07Z",
"content": "LG iPhone 17 \r\n Phonearena iPhone iPhone\r\n LG Display 2025 iPhone 17 2025 iPhone 17 \r\n BOE 2025 iPhone 17 iPhone 16e \r\n iPhone 17 120 Hz LTPO ProMotion 12 GB RAM Apple Intelligence iPhone 2026 2 A20 … [+10 chars]"
},
{
"source": {
"id": null,
"name": "Zoomit.ir"
},
"author": "مجتبی  بوالحسنی",
"title": "۳ محصول مورد انتظار اپل که سرانجام پاییز امسال عرضه می‌شوند",
"description": "اپل آماده است با سه محصول متفاوت، برگ تازه‌ای در طراحی و تکنولوژی ورق بزند؛ محصولاتی که کاربران انتظارشان را می‌کشیدند.",
"url": "https://www.zoomit.ir/tech/444290-apple-three-products-launching-fall/",
"urlToImage": "https://api2.zoomit.ir/media/apple-logo-three-new-shots-twentyfive-679c8769017fd128760ddd55",
"publishedAt": "2025-07-19T13:35:00Z",
"content": ". .\r\n. . UWB ( ) . .\r\n9to5Mac . . 4K . A18 Apple Intelligence .\r\n. X . . \r\n ."
},
{
"source": {
"id": null,
"name": "Appleinsider.ru"
},
"author": "Кирилл Пироженко",
"title": "Что делать, если не проходит перевод и неправильно отображается баланс карты в Т-Банке на iPhone",
"description": "Если в приложении Т-Банка на iPhone не проходит перевод между счетами или неправильно отображается баланс карты, то необходимо обновить его до новой версии. Как это можно сделать, если Т-Банка уже давно нет в App Store.",
"url": "https://appleinsider.ru/tips-tricks/chto-delat-esli-ne-proxodit-perevod-i-nepravilno-otobrazhaetsya-balans-karty-v-t-banke-na-iphone.html",
"urlToImage": "https://appleinsider.ru/wp-content/uploads/2025/07/t_bank_update_iphone_head-1000x526.jpg",
"publishedAt": "2025-07-19T08:00:12Z",
"content": "-. , SIM- , . - , , , . , , , , . \r\n «-» \r\n❗️ APPLE \r\n , , iPhone ( , ), , , Black. - , , .\r\n ? , , , . 15 , . , , . , , - -, iPhone, , .\r\n , , \r\n, . , . , , - , . , - , «» . . - iPhone :\r\n<ol><li> -… [+234 chars]"
}
]
}